#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web/runs/run-7op1tbAB6UbrZSWG

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E5VWR9I7KGZSJ]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=1920302536]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E3PO6D275Y4WSU]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe.initialised.si,private]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"]: Refreshing state... [id=static/css/main.af03688d.css]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.map"]: Refreshing state... [id=static/js/main.70e7bbba.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"]: Refreshing state... [id=static/js/106.74767f96.chunk.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"]: Refreshing state... [id=static/css/main.af03688d.css.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"]: Refreshing state... [id=static/js/106.74767f96.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js"]: Refreshing state... [id=static/js/main.70e7bbba.js]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.70e7bbba.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "33f06a95c0dc40f86728dd83e2ba7cff" -> "004b01eeabad1a9cb650b2652f761455"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "_JJvOD9344ta1rWvmLbN.qsbSg1hrfMJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "c156374594761324aadaaad4a5cb73a1" -> "8b801c74036c6ade824c2b33b076ea75"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "OZ7eThy8ybPpTFIlH55_KPL6PQ44Purl" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js"] will be destroyed
  # (because key ["static/js/main.70e7bbba.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "34fe535b476e67c354d20e05112ddaf6" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.70e7bbba.js" -> null
      - key                    = "static/js/main.70e7bbba.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.70e7bbba.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "uOBxdY7kugqgFSQSSPDkQoCGjOCx.59q" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.70e7bbba.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "e3f71d2c7f7fb57d48ae08488b42fd48" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.70e7bbba.js.LICENSE.txt" -> null
      - key                    = "static/js/main.70e7bbba.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.70e7bbba.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "JS5UKI.U5XnuyZGOH_3ZaqgmrXw2dqn_" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.70e7bbba.js.map"] will be destroyed
  # (because key ["static/js/main.70e7bbba.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "27278813603ee0a4a97ab6bfa54e4cc6" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.70e7bbba.js.map" -> null
      - key                    = "static/js/main.70e7bbba.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.70e7bbba.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "4VBN1N_vAJZh921Qodm9xT3aBRgj_Np_" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "21680880856c22ee93f287ca3f386557"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "e3f71d2c7f7fb57d48ae08488b42fd48"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e5a98d92.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "b10d7fdfb9cbd41bf19196af9672855e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e5a98d92.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e5a98d92.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*